In [178]:
import pandas as pd
import numpy as np
import random
import datetime

주어진 Python list L 을 Pandas series 로 변환하는 코드를 작성해보세요.

L = [1, 2, 3, 4, 5]

'''
code here
'''

In [4]:
L = [1, 2, 3, 4, 5]
pd.Series(L)

0    1
1    2
2    3
3    4
4    5
dtype: int64

열의 이름은 A, B, C, D이고 각 열마다 5개의 random한(임의의) 숫자를 원소로 하는 DataFrame을 생성하는 코드를 작성해보세요.

In [10]:
df = pd.DataFrame(np.random.randn(5,4), columns=list('ABCD'))
df

          A         B         C         D
0  1.462718  0.844305 -0.269218  0.403565
1  1.596923  0.450359  0.888676  1.097836
2  0.395473 -1.082011  0.911577 -1.297200
3  0.514123 -0.286288 -0.186420  0.977753
4  0.274325  1.003938 -0.561098  1.949581

2번 문제에서 생성한 DataFrame의 index로 2020년 1월 1일 부터 2020년 1월 5일까지의 날짜를 지정하는 코드를 작성해보세요.

In [15]:
date = pd.date_range('2020-1-1', periods=5)
df_A = pd.DataFrame(np.random.randn(5,4), columns=list('ABCD')).set_index(date)

다음 그림과 같은 DataFrame을 만드는 코드를 작성해보세요.

In [17]:
A, B, C, D = [], [], [], []

for i in range(12):

    A.append('A'+str(i))

    B.append('A'+str(i))

    C.append('A'+str(i))

    D.append('A'+str(i))

df_B = pd.DataFrame({'A' : A, 'B' : B, 'C' : C, 'D' : D})

In [18]:
df_B

      A    B    C    D
0    A0   A0   A0   A0
1    A1   A1   A1   A1
2    A2   A2   A2   A2
3    A3   A3   A3   A3
4    A4   A4   A4   A4
5    A5   A5   A5   A5
6    A6   A6   A6   A6
7    A7   A7   A7   A7
8    A8   A8   A8   A8
9    A9   A9   A9   A9
10  A10  A10  A10  A10
11  A11  A11  A11  A11

df_B를 이용해서, 위에서부터 5개의 행을 출력하는 코드를 작성해보세요.

In [20]:
df_B.head()
df_B[:5]

    A   B   C   D
0  A0  A0  A0  A0
1  A1  A1  A1  A1
2  A2  A2  A2  A2
3  A3  A3  A3  A3
4  A4  A4  A4  A4

df_B를 이용해서, DataFrame의 index와 columns, values를 각각 추출해내는 코드를 작성해보세요.

In [25]:
print(df_B.index)

print(df_B.columns)

print(df_B.values)

RangeIndex(start=0, stop=12, step=1)
Index(['A', 'B', 'C', 'D'], dtype='object')
[['A0' 'A0' 'A0' 'A0']
 ['A1' 'A1' 'A1' 'A1']
 ['A2' 'A2' 'A2' 'A2']
 ['A3' 'A3' 'A3' 'A3']
 ['A4' 'A4' 'A4' 'A4']
 ['A5' 'A5' 'A5' 'A5']
 ['A6' 'A6' 'A6' 'A6']
 ['A7' 'A7' 'A7' 'A7']
 ['A8' 'A8' 'A8' 'A8']
 ['A9' 'A9' 'A9' 'A9']
 ['A10' 'A10' 'A10' 'A10']
 ['A11' 'A11' 'A11' 'A11']]

df_B를 이용해서, DataFrame의 요약 정보를 출력하는 코드를 작성해보세요.

In [26]:
df_B.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       12 non-null     object
 1   B       12 non-null     object
 2   C       12 non-null     object
 3   D       12 non-null     object
dtypes: object(4)
memory usage: 512.0+ bytes

df_A를 이용해서, 해당 DataFrame의 전체적인 통계량(통계정보)을 보여주는 코드를 작성해보세요.

In [27]:
df_A.describe()

              A         B         C         D
count  5.000000  5.000000  5.000000  5.000000
mean   0.128252  0.707295 -0.746631 -0.217132
std    0.648695  1.122828  1.011173  0.748778
min   -0.532452 -0.851128 -2.049898 -1.269074
25%   -0.259855  0.525255 -1.585959 -0.585587
50%   -0.047869  0.683377 -0.346967 -0.175509
75%    0.343967  0.873922  0.060520  0.317187
max    1.137467  2.305047  0.189149  0.627323

df_A를 이용해서, column C 기준으로 내림차순 정렬한 결과를 출력하는 코드를 작성해보세요.

In [35]:
df_A.sort_values(by='C', ascending=True)

                   A         B         C         D
2020-01-03 -0.532452  0.873922 -2.049898 -0.585587
2020-01-02  0.343967 -0.851128 -1.585959  0.317187
2020-01-05 -0.259855  0.683377 -0.346967 -1.269074
2020-01-01 -0.047869  0.525255  0.060520 -0.175509
2020-01-04  1.137467  2.305047  0.189149  0.627323

df_A를 이용해서, column A(A열)를 출력하는 코드를 작성해보세요.

In [38]:
df_A.A
df_A['A']

2020-01-01   -0.047869
2020-01-02    0.343967
2020-01-03   -0.532452
2020-01-04    1.137467
2020-01-05   -0.259855
Freq: D, Name: A, dtype: float64

df_A를 이용해서,

3번째 행의 원소들,

index가 2020-01-05에 해당하는 행

을 출력하는 코드를 작성해보세요.

In [51]:
df_A.iloc[2]
df_A.loc['2020-01-05']

A   -0.259855
B    0.683377
C   -0.346967
D   -1.269074
Name: 2020-01-05 00:00:00, dtype: float64

df_A를 이용해서, 2020년 1월 2일부터 2020년 1월 4일까지의 데이터중에 column A, B에 해당하는 데이터를 출력하는 코드를 작성해보세요.

In [67]:
df_A.iloc[1:4][['A','B']]

                   A         B
2020-01-02  0.343967 -0.851128
2020-01-03 -0.532452  0.873922
2020-01-04  1.137467  2.305047

df_A에서 0보다 큰 데이터를 모두 출력하는 코드를 작성하세요.

(해당 데이터가 조건에 해당되지 않아 빈 칸일때 NaN으로 출력됩니다. NaN은 Not a Number 라는 의미입니다.)

In [76]:
df_A[df_A[:] > 0]
df_A[df_A > 0]

                   A         B         C         D
2020-01-01       NaN  0.525255  0.060520       NaN
2020-01-02  0.343967       NaN       NaN  0.317187
2020-01-03       NaN  0.873922       NaN       NaN
2020-01-04  1.137467  2.305047  0.189149  0.627323
2020-01-05       NaN  0.683377       NaN       NaN

데이터에서 주어진 형태가 같은 2개의 DataFrame 을 이용해서,

Output처럼 위-아래로 합쳐진 DataFrame을 생성하는 코드를 작성해보세요.

In [80]:
x = pd.DataFrame({'A' : [1,2],
                  'B' : [3,4],
                  'C' : [5,6],
                 })

y = pd.DataFrame({'A' : [-1,-2],
                  'B' : [-3,-4],
                  'C' : [-5,-6],
                 })

In [84]:
pd.concat([x,y], ignore_index=True)

   A  B  C
0  1  3  5
1  2  4  6
2 -1 -3 -5
3 -2 -4 -6

In [92]:
pd.concat([x,y], axis=1)

   A  B  C  A  B  C
0  1  3  5 -1 -3 -5
1  2  4  6 -2 -4 -6

현재 작성중인 코드와 같은 폴더(=디렉토리) 내에 train.csv 파일이 있을 때, train.csv 파일을 불러오는 코드를 작성해보세요.

In [93]:
train = pd.read_csv('./train.csv')

사용하는 코드와 같은 디렉토리 내에 report.xlsx 파일이 있을 때, report.xlsx 파일의 'report' Sheet 를 불러오는 코드를 작성해보세요.

In [94]:
report = pd.read_excel('./report.xlsx')

작성한 코드 파일의 이름을 solution.py(or .ipynb) 이라고 할 때, 같은 디렉토리 내에 result 폴더를 만들고, result 폴더의 내부에 수정된 데이터를 train(edited).csv로 저장하는 코드를 작성해보세요.

In [91]:
train.to_csv("./result/train(edited)")

데이터를 읽어와서, NaN(Not a Number)로 처리되어 있는 행을 모두 제거하는 코드를 작성하세요.

In [161]:
df_C = pd.read_excel('./toy.xlsx')
df_C.dropna(axis=0)

     A    B    C
0  1.0 -1.0  2.0
2  3.0 -3.0  4.0
3  4.0 -4.0  7.0

df_C에서 NaN값을 해당 열에 바로 앞 행에 등장한 값으로 치환하는 방법으로 처리하는 코드를 작성해보세요.

In [163]:
df_C = pd.read_excel('./toy.xlsx')
df_C.ffill()

df_C.fillna(method='ffill')

     A    B     C
0  1.0 -1.0   2.0
1  2.0 -1.0   3.0
2  3.0 -3.0   4.0
3  4.0 -4.0   7.0
4  5.0 -4.0   7.0
5  5.0 -6.0  10.0

df_C에 등장하는 NaN값을 해당 열의 평균 값으로 대체하는 방법으로 처리하는 코드를 작성해보세요.

In [149]:
df_C.fillna(df_C.mean())

     A    B     C
0  1.0 -1.0   2.0
1  2.0 -3.5   3.0
2  3.0 -3.0   4.0
3  4.0 -4.0   7.0
4  5.0 -3.5   5.2
5  3.0 -6.0  10.0

df_C에 등장하는 모든 NaN값을 전체 데이터의 평균 값으로 대체하는 방법으로 처리하는 코드를 작성해보세요.

In [162]:
df_C.mean().mean()

1.5666666666666667

각 row(행)의 평균을 저장하고 있는 column(열)을 만들고, column의 이름을 "평균"으로 지정하는 코드를 작성하세요.

In [206]:
df = pd.DataFrame({'A': [1,2,3,4,5],
              'B': [-1,-2,-3,-4,-5],
              'C': [2,3,4,7,8]})

In [207]:
df['평균'] = df.mean(axis=1)
df

   A  B  C        평균
0  1 -1  2  0.666667
1  2 -2  3  1.000000
2  3 -3  4  1.333333
3  4 -4  7  2.333333
4  5 -5  8  2.666667

직전 문제에서의 DataFrame을 그대로 활용하여, 각 열마다의 합계를 맨 마지막 행(5행)으로 추가하는 코드를 작성해보세요.

In [208]:
df = df.append(df.sum(axis=0), ignore_index=True)

생성된 DataFrame에서 label A와 label B를 기준으로 val1, val2, val3의 합계를 구하는 코드를 작성해보세요.

In [211]:
df2 = pd.DataFrame({'val1' : list(range(1,6)),
                    'val2' : list(range(-1,-6,-1)),
                    'val3' : [2,3,4,7,8],
                    'label': ['A','A','B','B','B']})
df2

   val1  val2  val3 label
0     1    -1     2     A
1     2    -2     3     A
2     3    -3     4     B
3     4    -4     7     B
4     5    -5     8     B

In [213]:
df2.groupby('label').sum()

       val1  val2  val3
label
A         3    -3     5
B        12   -12    19

직전 문제와 동일한 DataFrame 을 이용하여, label column을 기준으로 pivot table(피벗테이블)을 생성하는 코드를 작성해보세요.

In [214]:
pd.pivot_table(df2, index = 'label')

       val1  val2      val3
label
A       1.5  -1.5  2.500000
B       4.0  -4.0  6.333333